#include<iostream>
using namespace std;

void main()
{
	setlocale(LC_ALL, "Russian");

	const int n = 10;
	int arr[n];
	//1. Заполняем массив случайными числами:
	for (int i = 0; i < n; i++)
	{
		arr[i] = rand() % 10;
	}

	//2. Выводим массив на экран:
	for (int i = 0; i < n; i++)
	{
		cout << arr[i] << "\t";
	}
	cout << endl;

	//3. Поиск повторяющихся значений:

	for (int i = 0; i < n; i++)
	{
		//Вся магия происходит здесь:
		//I. Проверяем а не встречалось ли выбранное значение ранее.
		//Если встречалось, то мы уже посчитали сколько раз оно повторяется
		//и вывели его на экран
		bool alreadyThere = false;//Предполагаем, что значение в выбранном элементеНЕ встречалось ранее,
		//НО это нужно проверить:
		for (int j = 0; j < i; j++)
		{
			if (arr[i] == arr[j])//Если произошло совпадение
			{
				alreadyThere = true;//Запоминаем, что выюранное значение уже вствечалось в массиве
				break;//Прерывает текущую итерацию, и все последующие
			}
		}
		if (alreadyThere)continue;//Ключевое слово continue прерывает текущую итерацию, и переходит к следующей
		//II.
		//int count = 0;//Счетчик повторений
		int count = 1; //Счетчик вхождений. Любое значение, которое есть в массиве, встречается там хотя бы 1 раз.
		//Перебираем правую часть массива относительно выбранного элемента:
		for (int j = i + 1; j < n; j++)
		{
			if (arr[i] == arr[j])count++;//ЕСЛИ произошло совпадение, увеличиваем счетчик вхождений.
		}
		//if (count > 1) cout << "Значение " << arr[i] << " встречается " << count << " раз\n";
		if (count > 1)printf("Значение %d встречается %d раз\n", arr[i], count);
		//%d (decimal) - десятичное значение, либо целое, либо дроюное
	}
}